In [1]:
import pandas as pd

In [7]:
import numpy as np

In [8]:
from numpy.random import randn
df=pd.DataFrame(data=randn(5,5),index=['A','B','C','D','E'],columns=['V','W','X','Y','Z'])

In [9]:
df

          V         W         X         Y         Z
A -0.594663  0.328786  1.239009  0.971493  0.596851
B  0.031611  1.475781  0.515902 -0.172674 -0.031624
C -2.061865  1.229858  0.934073  0.869807 -0.729774
D -2.093132 -1.010719  1.829554 -2.478122 -0.652411
E  1.383841 -1.712355 -0.703316 -0.410277  2.522401

In [10]:
bool_df=df>0

In [11]:
bool_df

       V      W      X      Y      Z
A  False   True   True   True   True
B   True   True   True  False  False
C  False   True   True   True  False
D  False  False   True  False  False
E   True  False  False  False   True

In [12]:
df['W']>0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [13]:
df[df['W']>0]

          V         W         X         Y         Z
A -0.594663  0.328786  1.239009  0.971493  0.596851
B  0.031611  1.475781  0.515902 -0.172674 -0.031624
C -2.061865  1.229858  0.934073  0.869807 -0.729774

In [15]:
result=df[df['Z']<0]

In [16]:
result

          V         W         X         Y         Z
B  0.031611  1.475781  0.515902 -0.172674 -0.031624
C -2.061865  1.229858  0.934073  0.869807 -0.729774
D -2.093132 -1.010719  1.829554 -2.478122 -0.652411

In [17]:
result["X"]

B    0.515902
C    0.934073
D    1.829554
Name: X, dtype: float64

In [19]:
df[df['Z']<0]['X']

B    0.515902
C    0.934073
D    1.829554
Name: X, dtype: float64

In [28]:
df[(df['W']>0) & (df['Y']>0.5)]

          V         W         X         Y         Z States
A -0.594663  0.328786  1.239009  0.971493  0.596851     NY
C -2.061865  1.229858  0.934073  0.869807 -0.729774     UH

In [21]:
df

          V         W         X         Y         Z
A -0.594663  0.328786  1.239009  0.971493  0.596851
B  0.031611  1.475781  0.515902 -0.172674 -0.031624
C -2.061865  1.229858  0.934073  0.869807 -0.729774
D -2.093132 -1.010719  1.829554 -2.478122 -0.652411
E  1.383841 -1.712355 -0.703316 -0.410277  2.522401

In [24]:
newind='NY JK UH KJ LP'.split()
newind

['NY', 'JK', 'UH', 'KJ', 'LP']

In [25]:
df['States']=newind

In [26]:
df.set_index('States')

               V         W         X         Y         Z
States
NY     -0.594663  0.328786  1.239009  0.971493  0.596851
JK      0.031611  1.475781  0.515902 -0.172674 -0.031624
UH     -2.061865  1.229858  0.934073  0.869807 -0.729774
KJ     -2.093132 -1.010719  1.829554 -2.478122 -0.652411
LP      1.383841 -1.712355 -0.703316 -0.410277  2.522401